<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"6777a70817dc40480527a4e7ede9ce30bfd31c4818f0623bee362592c0243348","plan_job_ref":"Job Pull Request Checks #362 at https://github.com/GSA-TTS/FAC/actions/runs/21764184389","plan_out_hash":"0cb9b5aec4878a12d3686288a9fdcddbf7dbe5d0cedd083a8c66050538f0d706","plan_hash":"b110844bb6c5d10e2868f5e8b52d1eda2655de36c313ad1f03e69b1890641283","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 12 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2026-02-06T17:02:12Z" -> (known after apply)
        }
    }

  # module.dev.module.newrelic.newrelic_alert_policy.main will be created
+   resource "newrelic_alert_policy" "main" {
+       account_id          = (known after apply)
+       id                  = (known after apply)
+       incident_preference = "PER_CONDITION"
+       name                = "Dev Alerts"
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.db_slow_queries will be created
+   resource "newrelic_nrql_alert_condition" "db_slow_queries" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Production DB Statement Duration"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 150
+           threshold_duration              = 120
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT average(`duration.ms`) FROM Span FACET `db.statement` WHERE entity.name ='gsa-fac-dev'"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.error_rate will be created
+   resource "newrelic_nrql_alert_condition" "error_rate" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       baseline_direction           = "upper_and_lower"
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "gsa-fac-dev - Error rate"
+       policy_id                    = (known after apply)
+       type                         = "baseline"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 10
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT (count(apm.service.error.count) / count(apm.service.transaction.duration)) * 100 AS 'Error %' FROM Metric WHERE entity.guid = 'MzkxOTA3NnxBUE18QVBQTElDQVRJT058MTA0OTM0MDMzNQ'"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.http_500_errors will be created
+   resource "newrelic_nrql_alert_condition" "http_500_errors" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Production Request Received a 500 Status"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 0
+           threshold_duration              = 60
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE response.status = '500' and appName = 'gsa-fac-dev'"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.infected_file will be created
+   resource "newrelic_nrql_alert_condition" "infected_file" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Infected File Found!"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above_or_equals"
+           threshold                       = 1
+           threshold_duration              = 300
+           threshold_occurrences           = "at_least_once"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) FROM Log WHERE tags.space_name ='dev' and message LIKE '%ScanResult.INFECTED%'"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.long_running_web_fn will be created
+   resource "newrelic_nrql_alert_condition" "long_running_web_fn" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Long Running Web Function ( > 200ms)"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 20
+           threshold_duration              = 60
+           threshold_occurrences           = "at_least_once"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) FROM Transaction  WHERE appName = 'gsa-fac-dev' EXTRAPOLATE FACET name where name not like 'WebTransaction/Function/api.views:Sprite.get'"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.response_time will be created
+   resource "newrelic_nrql_alert_condition" "response_time" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       baseline_direction           = "upper_and_lower"
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "gsa-fac-dev - Response time (ms)"
+       policy_id                    = (known after apply)
+       type                         = "baseline"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT average(apm.service.transaction.duration) * 1000 AS 'Response time (ms)' FROM Metric WHERE entity.guid = 'MzkxOTA3NnxBUE18QVBQTElDQVRJT058MTA0OTM0MDMzNQ'"
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 3
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.slow_transactions will be created
+   resource "newrelic_nrql_alert_condition" "slow_transactions" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Slow Transactions"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) from Transaction where appName = 'gsa-fac-dev' facet name"
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 15
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.synth_uptime_check will be created
+   resource "newrelic_nrql_alert_condition" "synth_uptime_check" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Ping of app.fac.gov failed"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 1
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT filter(count(*), WHERE result = 'FAILED') AS 'Failures' FROM SyntheticCheck WHERE entityGuid IN ('MzkxOTA3NnxTWU5USHxNT05JVE9SfDVhYTZjMzcxLTFhODYtNDFjZS1hMjY1LTk3NjdkMzU4ZWIyZg') FACET monitorName"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.throughput will be created
+   resource "newrelic_nrql_alert_condition" "throughput" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       baseline_direction           = "upper_and_lower"
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "gsa-fac-dev - Throughput"
+       policy_id                    = (known after apply)
+       type                         = "baseline"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT rate(count(apm.service.transaction.duration), 1 minute) AS 'Throughput' FROM Metric WHERE entity.guid = 'MzkxOTA3NnxBUE18QVBQTElDQVRJT058MTA0OTM0MDMzNQ'"
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 3
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.transaction_error will be created
+   resource "newrelic_nrql_alert_condition" "transaction_error" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Transaction Error Occured"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above_or_equals"
+           threshold                       = 1
+           threshold_duration              = 60
+           threshold_occurrences           = "at_least_once"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "select count(*) from TransactionError where (error.message != 'bad role' and appName = 'gsa-fac-dev') FACET error.message, request.uri, error.class "
        }
    }

Plan: 12 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #362](https://github.com/GSA-TTS/FAC/actions/runs/21764184389)